Klipper3d/klipper/lib/asf/sam/utils/cmsis/samv71/include/samv71j20.h
/**
 * \file
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAMV71J20_
#define _SAMV71J20_

/** \addtogroup SAMV71J20_definitions SAMV71J20 definitions
  This file defines all structures and symbols for SAMV71J20:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMV71J20 */
/* ************************************************************************** */
/** \addtogroup SAMV71J20_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M7 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M7 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M7 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M7 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M7 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M7 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M7 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M7 System Tick Interrupt       */
/******  SAMV71J20 specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAMV71J20 Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAMV71J20 Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAMV71J20 Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAMV71J20 Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAMV71J20 Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAMV71J20 Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAMV71J20 Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  7, /**<  7 SAMV71J20 UART 0 (UART0) */
  UART1_IRQn           =  8, /**<  8 SAMV71J20 UART 1 (UART1) */
  PIOA_IRQn            = 10, /**< 10 SAMV71J20 Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 11, /**< 11 SAMV71J20 Parallel I/O Controller B (PIOB) */
  USART0_IRQn          = 13, /**< 13 SAMV71J20 USART 0 (USART0) */
  USART1_IRQn          = 14, /**< 14 SAMV71J20 USART 1 (USART1) */
  PIOD_IRQn            = 16, /**< 16 SAMV71J20 Parallel I/O Controller D (PIOD) */
  TWIHS0_IRQn          = 19, /**< 19 SAMV71J20 Two Wire Interface 0 HS (TWIHS0) */
  TWIHS1_IRQn          = 20, /**< 20 SAMV71J20 Two Wire Interface 1 HS (TWIHS1) */
  SSC_IRQn             = 22, /**< 22 SAMV71J20 Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 23, /**< 23 SAMV71J20 Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAMV71J20 Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAMV71J20 Timer/Counter 2 (TC2) */
  AFEC0_IRQn           = 29, /**< 29 SAMV71J20 Analog Front End 0 (AFEC0) */
  DACC_IRQn            = 30, /**< 30 SAMV71J20 Digital To Analog Converter (DACC) */
  PWM0_IRQn            = 31, /**< 31 SAMV71J20 Pulse Width Modulation 0 (PWM0) */
  ICM_IRQn             = 32, /**< 32 SAMV71J20 Integrity Check Monitor (ICM) */
  ACC_IRQn             = 33, /**< 33 SAMV71J20 Analog Comparator (ACC) */
  USBHS_IRQn           = 34, /**< 34 SAMV71J20 USB Host / Device Controller (USBHS) */
  MCAN0_INT0_IRQn      = 35, /**< 35 SAMV71J20 Controller Area Network (MCAN0) */
  MCAN0_INT1_IRQn      = 36, /**< 36 SAMV71J20 Controller Area Network (MCAN0) */
  GMAC_IRQn            = 39, /**< 39 SAMV71J20 Ethernet MAC (GMAC) */
  AFEC1_IRQn           = 40, /**< 40 SAMV71J20 Analog Front End 1 (AFEC1) */
  QSPI_IRQn            = 43, /**< 43 SAMV71J20 Quad I/O Serial Peripheral Interface (QSPI) */
  UART2_IRQn           = 44, /**< 44 SAMV71J20 UART 2 (UART2) */
  TC9_IRQn             = 50, /**< 50 SAMV71J20 Timer/Counter 9 (TC9) */
  TC10_IRQn            = 51, /**< 51 SAMV71J20 Timer/Counter 10 (TC10) */
  TC11_IRQn            = 52, /**< 52 SAMV71J20 Timer/Counter 11 (TC11) */
  MLB_IRQn             = 53, /**< 53 SAMV71J20 MediaLB (MLB) */
  AES_IRQn             = 56, /**< 56 SAMV71J20 AES (AES) */
  TRNG_IRQn            = 57, /**< 57 SAMV71J20 True Random Generator (TRNG) */
  XDMAC_IRQn           = 58, /**< 58 SAMV71J20 DMA (XDMAC) */
  ISI_IRQn             = 59, /**< 59 SAMV71J20 Camera Interface (ISI) */
  PWM1_IRQn            = 60, /**< 60 SAMV71J20 Pulse Width Modulation 1 (PWM1) */
  FPU_IRQn             = 61, /**< 61 SAMV71J20 Floating Point Unit Registers (FPU) */
  RSWDT_IRQn           = 63, /**< 63 SAMV71J20 Reinforced Secure Watchdog Timer (RSWDT) */
  CCW_IRQn             = 64, /**< 64 SAMV71J20 System Control Registers (SystemControl) */
  CCF_IRQn             = 65, /**< 65 SAMV71J20 System Control Registers (SystemControl) */
  GMAC_Q1_IRQn         = 66, /**< 66 SAMV71J20 Gigabit Ethernet MAC (GMAC) */
  GMAC_Q2_IRQn         = 67, /**< 67 SAMV71J20 Gigabit Ethernet MAC (GMAC) */
  IXC_IRQn             = 68, /**< 68 SAMV71J20 Floating Point Unit Registers (FPU) */

  PERIPH_COUNT_IRQn    = 74  /**< Number of peripheral IDs */
} IRQn_Type;

